app/Controllers/Internal/RoomController.php

SELECT *
FROM `rooms`
---
    public function index()
    {
        $rooms = $this->roomModel->findAll();