app/Controllers/Internal/RoomCategoryController.php

SELECT *
FROM `room_categories`
---
    public function index()
    {
        $room_categories = $this->roomCategoryModel->findAll();

SELECT *
FROM `room_categories`
WHERE `room_categories`.`id` = '4'
---
    public function edit($id){
        $room_category = $this->roomCategoryModel->find($id);