app/Controllers/Internal/UserController.php

    public function index()
    {
        $users = $this->usersModel->findAll();
---
SELECT *
FROM `users`

    public function edit($id){
        $user = $this->usersModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'

    public function update($id){
        if (! $this->validate([
            'name' => [
                'rules'=>'required',
                'errors'=>[
                    'required'=>'Name cannot be empty'
                ]
            ],
            'email' => [
                'rules'=>'required',
                'errors'=>[
                    'required'=>'Email cannot be empty'
                ]
            ],

            'phone_number' => [
                'rules'=>'required|numeric',
                'errors'=>[
                    'required'=>'Phone Number cannot be empty',
                    'numeric'=>'Phone Number must be numeric',
                ]
            ],

        ])){
            $validation =  \Config\Services::validation();
//            dd($validation);
            return redirect()->to('internal/users/edit/'.$id)->withInput()->with('validation',$validation);
        }

        $file=$this->request->getFile('avatar');
        $user = $this->usersModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'


            }
        }
        $this->usersModel->update($id,$data);
---
UPDATE `users` SET `name` = 'Zhafari-2', `email` = 'Zhafari-2@test.com', `password` = '$2y$10$paLexr.8Xn53fVbLebhAdeO4magA5nAX9YBZim.9R1ym4gGod3Du.', `phone_number` = '083548348572', `avatar` = '1649484379_d711e166721c51ffe3c8.png', `updated_at` = '2022-04-09 01:06:19'
WHERE `users`.`id` IN ('2')